rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_03_Task_Delay_Periodic/src/main.c
/**
 * ============================================================================
 * PROGRAM 03: Task Delay Periodic - Perbandingan vTaskDelay vs vTaskDelayUntil
 * ============================================================================
 * 
 * Deskripsi:
 *   Program ini mendemonstrasikan perbedaan antara vTaskDelay() dan
 *   vTaskDelayUntil() untuk task periodik. Menggunakan DWT cycle counter
 *   untuk mengukur periode aktual dengan resolusi tinggi (13.9 ns pada 72MHz).
 * 
 * Konsep yang Dipelajari:
 *   1. vTaskDelay()      - Delay relatif (mengakumulasi drift)
 *   2. vTaskDelayUntil() - Delay absolut (kompensasi waktu eksekusi)
 *   3. DWT CYCCNT        - Hardware cycle counter untuk pengukuran presisi
 *   4. Jitter Analysis   - Variasi waktu antar eksekusi periodik
 *   5. Timing Drift      - Akumulasi kesalahan waktu
 * 
 * Perbedaan Kunci:
 * 
 *   vTaskDelay(100ms):
 *     ┌──work──┐          ┌──work──┐          ┌──work──┐
 *     │  10ms  │ 100ms    │  10ms  │ 100ms    │  10ms  │
 *     └────────┘──────────└────────┘──────────└────────┘
 *     Periode aktual = work + delay = 110ms (DRIFT!)
 * 
 *   vTaskDelayUntil(100ms):
 *     ┌──work──┐        ┌──work──┐        ┌──work──┐
 *     │  10ms  │ 90ms   │  10ms  │ 90ms   │  10ms  │
 *     └────────┘────────└────────┘────────└────────┘
 *     Periode aktual = 100ms (TEPAT, kompensasi otomatis)
 * 
 * Hardware:
 *   - STM32F103C8 Blue Pill (72 MHz, 20KB SRAM)
 *   - LED PC13: Indikator vTaskDelay
 *   - LED PB0:  Indikator vTaskDelayUntil
 *   - LED PB1:  Indikator sistem aktif
 *   - USART1: PA9(TX)/PA10(RX) @ 115200 baud
 * 
 * Output Format:
 *   [DATA]DELAY,<sample>,<period_us>,<deviation_us>,<drift_us>,<tick>
 *   [DATA]UNTIL,<sample>,<period_us>,<deviation_us>,<drift_us>,<tick>
 *   [DATA]STATS,<type>,<mean_us>,<min_us>,<max_us>,<jitter_us>,<total_drift>
 *   [DATA]COMPARE,<delay_mean>,<until_mean>,<delay_jitter>,<until_jitter>
 * 
 * ============================================================================
 */

/* ========================== HEADER INCLUDES ============================== */
#include "stm32f1xx_hal.h"
#include "FreeRTOS.h"
#include "task.h"
#include "config.h"
#include <stdio.h>
#include <string.h>

/* ======================== VARIABEL GLOBAL ================================ */

static UART_HandleTypeDef huart1;

/* Handle task */
static TaskHandle_t xTaskDelayHandle  = NULL;
static TaskHandle_t xTaskUntilHandle  = NULL;
static TaskHandle_t xMonitorHandle    = NULL;

static volatile uint8_t ucSchedulerStarted = 0;

/**
 * Struktur untuk menyimpan data pengukuran timing
 * Setiap task periodik memiliki instance sendiri
 */
typedef struct {
    uint32_t ulSampleCount;             /* Jumlah sampel yang dikumpulkan    */
    uint32_t ulPeriodUs[MAX_SAMPLES];   /* Periode aktual setiap sampel (us) */
    uint32_t ulLastCycles;              /* Cycle counter pada iterasi lalu   */
    uint32_t ulExpectedPeriodUs;        /* Periode yang diharapkan (us)      */
    
    /* Statistik running */
    uint32_t ulSumPeriodUs;             /* Total periode untuk rata-rata     */
    uint32_t ulMinPeriodUs;             /* Periode minimum yang tercatat     */
    uint32_t ulMaxPeriodUs;             /* Periode maksimum yang tercatat    */
    int32_t  lTotalDriftUs;             /* Total drift kumulatif (signed)    */
    uint32_t ulJitterUs;                /* Jitter (max - min)                */
    
    /* Indeks sampel circular */
    uint32_t ulWriteIndex;              /* Indeks tulis ke array sampel      */
    uint8_t  ucBufferFull;              /* Flag buffer penuh                 */
} TimingData_t;

static volatile TimingData_t xDelayData = {
    .ulSampleCount = 0, .ulLastCycles = 0,
    .ulExpectedPeriodUs = TASK_DELAY_PERIOD_MS * 1000,
    .ulSumPeriodUs = 0, .ulMinPeriodUs = 0xFFFFFFFF,
    .ulMaxPeriodUs = 0, .lTotalDriftUs = 0, .ulJitterUs = 0,
    .ulWriteIndex = 0, .ucBufferFull = 0
};

static volatile TimingData_t xUntilData = {
    .ulSampleCount = 0, .ulLastCycles = 0,
    .ulExpectedPeriodUs = TASK_UNTIL_PERIOD_MS * 1000,
    .ulSumPeriodUs = 0, .ulMinPeriodUs = 0xFFFFFFFF,
    .ulMaxPeriodUs = 0, .lTotalDriftUs = 0, .ulJitterUs = 0,
    .ulWriteIndex = 0, .ucBufferFull = 0
};

static char pcPrintBuffer[PRINT_BUFFER_SIZE];

/* ==================== DEKLARASI FUNGSI PROTOTYPE ========================= */
static void SystemClock_Config(void);
static void GPIO_Init(void);
static void UART1_Init(void);
static void DWT_Init(void);
static uint32_t DWT_GetCycles(void);

static void vTaskDelayDemo(void *pvParameters);
static void vTaskDelayUntilDemo(void *pvParameters);
static void vTaskMonitor(void *pvParameters);

static void vSimulateWorkload(void);
static void vRecordTiming(TimingData_t volatile *pxData, uint32_t ulCurrentCycles);
static void vPrintTimingStats(const char *pcName, TimingData_t volatile *pxData);
static void vPrintSeparator(char cChar, uint8_t ucLen);

/* ========================= RETARGET PRINTF =============================== */
int _write(int file, char *ptr, int len) {
    (void)file;
    HAL_UART_Transmit(&huart1, (uint8_t*)ptr, len, HAL_MAX_DELAY);
    return len;
}

/* ===================== INTERRUPT HANDLERS ================================ */
void SysTick_Handler(void) {
    HAL_IncTick();
    if (ucSchedulerStarted) {
        xPortSysTickHandler();
    }
}

/* =================== HOOK FUNCTIONS FreeRTOS ============================= */

void vApplicationMallocFailedHook(void) {
    printf("\r\n[ERROR] !! MALLOC GAGAL !!\r\n");
    taskDISABLE_INTERRUPTS();
    for (;;) {
        HAL_GPIO_TogglePin(LED_DELAY_PORT, LED_DELAY_PIN);
        for (volatile uint32_t i = 0; i < 200000; i++);
    }
}

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName) {
    (void)xTask;
    printf("\r\n[ERROR] !! STACK OVERFLOW: %s !!\r\n", pcTaskName);
    taskDISABLE_INTERRUPTS();
    for (;;) {
        HAL_GPIO_TogglePin(LED_DELAY_PORT, LED_DELAY_PIN);
        for (volatile uint32_t i = 0; i < 100000; i++);
    }
}

void vApplicationGetIdleTaskMemory(StaticTask_t **ppxIdleTaskTCBBuffer,
                                   StackType_t **ppxIdleTaskStackBuffer,
                                   uint32_t *pulIdleTaskStackSize) {
    static StaticTask_t xIdleTaskTCB;
    static StackType_t uxIdleTaskStack[configMINIMAL_STACK_SIZE];
    *ppxIdleTaskTCBBuffer   = &xIdleTaskTCB;
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;
    *pulIdleTaskStackSize   = configMINIMAL_STACK_SIZE;
}

void vApplicationGetTimerTaskMemory(StaticTask_t **ppxTimerTaskTCBBuffer,
                                    StackType_t **ppxTimerTaskStackBuffer,
                                    uint32_t *pulTimerTaskStackSize) {
    static StaticTask_t xTimerTaskTCB;
    static StackType_t uxTimerTaskStack[configTIMER_TASK_STACK_DEPTH];
    *ppxTimerTaskTCBBuffer   = &xTimerTaskTCB;
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;
    *pulTimerTaskStackSize   = configTIMER_TASK_STACK_DEPTH;
}

/* ==================== KONFIGURASI SYSTEM CLOCK =========================== */

static void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL     = RCC_PLL_MUL9;

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        for (;;);
    }

