rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_03_Task_Delay_Periodic/src/main.c
    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                       RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK) {
        for (;;);
    }
}

/* ======================== INISIALISASI GPIO ============================== */

static void GPIO_Init(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    LED_DELAY_CLK_EN();
    LED_UNTIL_CLK_EN();
    LED_STATUS_CLK_EN();
    BTN_CLK_EN();

    /* LED PC13 - Indikator vTaskDelay (active LOW) */
    GPIO_InitStruct.Pin   = LED_DELAY_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(LED_DELAY_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LED_DELAY_PORT, LED_DELAY_PIN, GPIO_PIN_SET);

    /* LED PB0 - Indikator vTaskDelayUntil */
    GPIO_InitStruct.Pin = LED_UNTIL_PIN;
    HAL_GPIO_Init(LED_UNTIL_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LED_UNTIL_PORT, LED_UNTIL_PIN, GPIO_PIN_RESET);

    /* LED PB1 - Indikator Status */
    GPIO_InitStruct.Pin = LED_STATUS_PIN;
    HAL_GPIO_Init(LED_STATUS_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LED_STATUS_PORT, LED_STATUS_PIN, GPIO_PIN_RESET);

    /* Tombol PA0 */
    GPIO_InitStruct.Pin  = BTN_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(BTN_PORT, &GPIO_InitStruct);
}

/* ======================== INISIALISASI UART ============================== */

static void UART1_Init(void) {
    UART_CLK_EN();
    UART_GPIO_CLK_EN();

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin   = UART_TX_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(UART_TX_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin  = UART_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(UART_RX_PORT, &GPIO_InitStruct);

    huart1.Instance          = UART_INSTANCE;
    huart1.Init.BaudRate     = UART_BAUDRATE;
    huart1.Init.WordLength   = UART_WORDLENGTH_8B;
    huart1.Init.StopBits     = UART_STOPBITS_1;
    huart1.Init.Parity       = UART_PARITY_NONE;
    huart1.Init.Mode         = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;

    if (HAL_UART_Init(&huart1) != HAL_OK) {
        for (;;);
    }
}

/* ========================== DWT INIT ===================================== */

/**
 * Inisialisasi DWT (Data Watchpoint and Trace) Cycle Counter
 * 
 * DWT CYCCNT pada Cortex-M3:
 *   - Counter 32-bit yang menghitung siklus clock CPU
 *   - Pada 72 MHz: 1 siklus = 13.89 ns
 *   - Overflow setelah: 2^32 / 72MHz ≈ 59.65 detik
 *   - Resolusi jauh lebih baik dari SysTick (1ms)
 * 
 * Sangat penting untuk mengukur:
 *   - Periode aktual task periodik
 *   - Jitter antar eksekusi
 *   - Akumulasi drift
 */
static void DWT_Init(void) {
    /* Aktifkan trace module di System Control Block */
    SCB_DEMCR |= TRCENA_BIT;
    
    /* Unlock DWT (diperlukan pada beberapa implementasi Cortex-M) */
    DWT_LAR = DWT_LAR_UNLOCK;
    
    /* Reset dan aktifkan cycle counter */
    DWT_CYCCNT  = 0;
    DWT_CONTROL |= DWT_CTRL_ENABLE_BIT;
}

static uint32_t DWT_GetCycles(void) {
    return DWT_CYCCNT;
}

/* ========================= UTILITY FUNCTIONS ============================= */

static void vPrintSeparator(char cChar, uint8_t ucLen) {
    for (uint8_t i = 0; i < ucLen; i++) printf("%c", cChar);
    printf("\r\n");
}

/**
 * Simulasi beban kerja (workload) pada task periodik
 * 
 * Mengapa penting dalam demo ini:
 *   - vTaskDelay(100ms) sebenarnya menghasilkan periode = work_time + 100ms
 *   - vTaskDelayUntil(100ms) menghasilkan periode = 100ms (otomatis kompensasi)
 *   - Semakin lama work_time, semakin besar drift pada vTaskDelay
 * 
 * WORKLOAD_ITERATIONS dikonfigurasi di config.h agar bisa diubah
 * untuk menunjukkan efek yang lebih dramatis.
 */
static void vSimulateWorkload(void) {
    volatile uint32_t ulDummy = 0;
    for (uint32_t i = 0; i < WORKLOAD_ITERATIONS; i++) {
        ulDummy += i;
        /* Operasi tambahan untuk memastikan compiler tidak mengoptimasi */
        if (ulDummy > 0xFFFFFFF0) ulDummy = 0;
    }
}

/**
 * Catat data timing dari satu iterasi task periodik
 * 
 * Menghitung:
 *   1. Periode aktual (berapa lama antara dua iterasi berturutan)
 *   2. Deviasi dari periode yang diharapkan
 *   3. Drift kumulatif (total akumulasi kesalahan waktu)
 * 
 * @param pxData         Pointer ke struktur timing data
 * @param ulCurrentCycles Nilai DWT CYCCNT saat ini
 */
static void vRecordTiming(TimingData_t volatile *pxData, uint32_t ulCurrentCycles) {
    /* Pada iterasi pertama, simpan timestamp saja */
    if (pxData->ulLastCycles == 0) {
        pxData->ulLastCycles = ulCurrentCycles;
        return;
    }

    /* Hitung periode dalam siklus clock */
    uint32_t ulElapsedCycles = ulCurrentCycles - pxData->ulLastCycles;
    pxData->ulLastCycles = ulCurrentCycles;

    /* Konversi ke mikrodetik */
    uint32_t ulPeriodUs = CYCLES_TO_US(ulElapsedCycles);

    /* Simpan sampel ke buffer circular */
    uint32_t ulIdx = pxData->ulWriteIndex;
    pxData->ulPeriodUs[ulIdx] = ulPeriodUs;
    pxData->ulWriteIndex = (ulIdx + 1) % MAX_SAMPLES;
    if (pxData->ulWriteIndex == 0) {
        pxData->ucBufferFull = 1;
    }
    pxData->ulSampleCount++;

    /* Update statistik running */
    pxData->ulSumPeriodUs += ulPeriodUs;

    if (ulPeriodUs < pxData->ulMinPeriodUs) {
        pxData->ulMinPeriodUs = ulPeriodUs;
    }
    if (ulPeriodUs > pxData->ulMaxPeriodUs) {
        pxData->ulMaxPeriodUs = ulPeriodUs;
    }

