rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_03_Task_Delay_Periodic/src/main.c
    /* Hitung deviasi dari target */
    int32_t lDeviation = (int32_t)ulPeriodUs - (int32_t)pxData->ulExpectedPeriodUs;
    pxData->lTotalDriftUs += lDeviation;

    /* Update jitter (max - min) */
    pxData->ulJitterUs = pxData->ulMaxPeriodUs - pxData->ulMinPeriodUs;
}

/**
 * Cetak statistik timing lengkap untuk satu task
 * 
 * Menghitung dan menampilkan:
 *   - Rata-rata periode
 *   - Minimum dan maksimum periode
 *   - Jitter (variasi)
 *   - Total drift kumulatif
 *   - Deviasi dari target
 */
static void vPrintTimingStats(const char *pcName, TimingData_t volatile *pxData) {
    if (pxData->ulSampleCount == 0) {
        printf("  %s: Belum ada data\r\n", pcName);
        return;
    }

    /* Hitung rata-rata */
    uint32_t ulMeanUs = pxData->ulSumPeriodUs / pxData->ulSampleCount;
    int32_t  lMeanDev = (int32_t)ulMeanUs - (int32_t)pxData->ulExpectedPeriodUs;

    printf("  %-14s | Sampel: %4lu\r\n", pcName, (unsigned long)pxData->ulSampleCount);
    printf("    Target   : %lu us (%lu ms)\r\n",
           (unsigned long)pxData->ulExpectedPeriodUs,
           (unsigned long)(pxData->ulExpectedPeriodUs / 1000));
    printf("    Rata-rata: %lu us (deviasi: %+ld us)\r\n",
           (unsigned long)ulMeanUs, (long)lMeanDev);
    printf("    Minimum  : %lu us\r\n",
           (unsigned long)(pxData->ulMinPeriodUs == 0xFFFFFFFF ? 0 : pxData->ulMinPeriodUs));
    printf("    Maksimum : %lu us\r\n", (unsigned long)pxData->ulMaxPeriodUs);
    printf("    Jitter   : %lu us (max - min)\r\n", (unsigned long)pxData->ulJitterUs);
    printf("    Drift    : %+ld us (kumulatif)\r\n", (long)pxData->lTotalDriftUs);

    /* Data untuk Python parser */
    printf("[DATA]STATS,%s,%lu,%lu,%lu,%lu,%ld\r\n",
           pcName,
           (unsigned long)ulMeanUs,
           (unsigned long)(pxData->ulMinPeriodUs == 0xFFFFFFFF ? 0 : pxData->ulMinPeriodUs),
           (unsigned long)pxData->ulMaxPeriodUs,
           (unsigned long)pxData->ulJitterUs,
           (long)pxData->lTotalDriftUs);
}

/* ========================== TASK FUNCTIONS =============================== */

/**
 * Task Delay Demo: Menggunakan vTaskDelay() - RELATIF
 * 
 * vTaskDelay(100ms) berarti:
 *   "Tunda task ini selama 100ms DARI SEKARANG"
 * 
 * Masalah:
 *   - Jika task membutuhkan waktu 10ms untuk bekerja (work)
 *   - Total periode = 10ms (work) + 100ms (delay) = 110ms
 *   - Setiap iterasi, drift bertambah 10ms
 *   - Setelah 10 iterasi: drift = 100ms
 *   - Setelah 100 iterasi: drift = 1000ms = 1 detik!
 * 
 * Kapan menggunakan vTaskDelay():
 *   - Task yang tidak memerlukan timing presisi
 *   - Delay sederhana (debounce, LED blink, dll)
 *   - Polling dengan interval kasar
 */
static void vTaskDelayDemo(void *pvParameters) {
    (void)pvParameters;

    uint32_t ulSample = 0;

    printf("[%s] Task dimulai - vTaskDelay(%d ms)\r\n",
           TASK_DELAY_NAME, TASK_DELAY_PERIOD_MS);
    printf("[%s] Akan mengakumulasi drift karena waktu kerja\r\n\r\n",
           TASK_DELAY_NAME);

    for (;;) {
        /* Ambil timestamp di awal iterasi */
        uint32_t ulCycles = DWT_GetCycles();

        /* Toggle LED sebagai indikator visual */
        LED_DELAY_TOGGLE();

        /* Catat timing (bandingkan dengan iterasi sebelumnya) */
        vRecordTiming(&xDelayData, ulCycles);

        /* Simulasi beban kerja - ini yang menyebabkan drift */
        vSimulateWorkload();

        ulSample++;

        /* Cetak data setiap 10 sampel */
        if (ulSample % 10 == 0 && xDelayData.ulSampleCount > 0) {
            uint32_t ulLastPeriod = 0;
            if (xDelayData.ulWriteIndex > 0) {
                ulLastPeriod = xDelayData.ulPeriodUs[xDelayData.ulWriteIndex - 1];
            } else if (xDelayData.ucBufferFull) {
                ulLastPeriod = xDelayData.ulPeriodUs[MAX_SAMPLES - 1];
            }
            
            int32_t lDeviation = (int32_t)ulLastPeriod - 
                                 (int32_t)xDelayData.ulExpectedPeriodUs;

            printf("[%s] Sampel #%lu | Period: %lu us | Dev: %+ld us | Drift: %+ld us\r\n",
                   TASK_DELAY_NAME, (unsigned long)ulSample,
                   (unsigned long)ulLastPeriod, (long)lDeviation,
                   (long)xDelayData.lTotalDriftUs);

            printf("[DATA]DELAY,%lu,%lu,%ld,%ld,%lu\r\n",
                   (unsigned long)ulSample,
                   (unsigned long)ulLastPeriod,
                   (long)lDeviation,
                   (long)xDelayData.lTotalDriftUs,
                   (unsigned long)xTaskGetTickCount());
        }

        /**
         * vTaskDelay() - Delay RELATIF
         * 
         * Menempatkan task ke state BLOCKED selama minimal N ticks.
         * Timer mulai dihitung DARI SAAT FUNGSI INI DIPANGGIL.
         * 
         * pdMS_TO_TICKS() mengkonversi milidetik ke jumlah tick:
         *   100ms × 1000 Hz = 100 ticks
         */
        vTaskDelay(pdMS_TO_TICKS(TASK_DELAY_PERIOD_MS));
    }
}

/**
 * Task DelayUntil Demo: Menggunakan vTaskDelayUntil() - ABSOLUT
 * 
 * vTaskDelayUntil(&xLastWakeTime, 100ms) berarti:
 *   "Tunda task ini sampai 100ms SETELAH TERAKHIR KALI BANGUN"
 * 
 * Keunggulan:
 *   - Otomatis mengkompensasi waktu eksekusi task
 *   - Jika task bekerja 10ms, delay aktual = 90ms → periode = 100ms
 *   - Tidak mengakumulasi drift
 *   - Periode sangat konsisten (mendekati target)
 * 
 * Cara kerja:
 *   1. Simpan waktu terakhir bangun (xLastWakeTime)
 *   2. Setelah task selesai bekerja, hitung:
 *      delay_needed = target_period - (now - xLastWakeTime)
 *   3. Block selama delay_needed
 *   4. Update xLastWakeTime += target_period
 * 
 * Kapan menggunakan vTaskDelayUntil():
 *   - Task kontrol periodik (PID controller)
 *   - Sampling sensor dengan rate tetap
 *   - Transmisi data periodik
 *   - Setiap task yang memerlukan timing presisi
 */
static void vTaskDelayUntilDemo(void *pvParameters) {
    (void)pvParameters;

    uint32_t ulSample = 0;

    /**
     * xLastWakeTime menyimpan tick count terakhir kali task ini bangun.
     * Diinisialisasi dengan xTaskGetTickCount() saat pertama kali.
     * vTaskDelayUntil() akan mengupdate variabel ini secara otomatis.
     */
    TickType_t xLastWakeTime = xTaskGetTickCount();

    printf("[%s] Task dimulai - vTaskDelayUntil(%d ms)\r\n",
           TASK_UNTIL_NAME, TASK_UNTIL_PERIOD_MS);
    printf("[%s] Akan mengkompensasi waktu kerja secara otomatis\r\n\r\n",
           TASK_UNTIL_NAME);

