rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_03_Task_Delay_Periodic/src/main.c
    for (;;) {
        /* Ambil timestamp di awal iterasi */
        uint32_t ulCycles = DWT_GetCycles();

        /* Toggle LED indikator */
        LED_UNTIL_TOGGLE();

        /* Catat timing */
        vRecordTiming(&xUntilData, ulCycles);

        /* Simulasi beban kerja (sama dengan vTaskDelay task) */
        vSimulateWorkload();

        ulSample++;

        /* Cetak data setiap 10 sampel */
        if (ulSample % 10 == 0 && xUntilData.ulSampleCount > 0) {
            uint32_t ulLastPeriod = 0;
            if (xUntilData.ulWriteIndex > 0) {
                ulLastPeriod = xUntilData.ulPeriodUs[xUntilData.ulWriteIndex - 1];
            } else if (xUntilData.ucBufferFull) {
                ulLastPeriod = xUntilData.ulPeriodUs[MAX_SAMPLES - 1];
            }

            int32_t lDeviation = (int32_t)ulLastPeriod -
                                 (int32_t)xUntilData.ulExpectedPeriodUs;

            printf("[%s] Sampel #%lu | Period: %lu us | Dev: %+ld us | Drift: %+ld us\r\n",
                   TASK_UNTIL_NAME, (unsigned long)ulSample,
                   (unsigned long)ulLastPeriod, (long)lDeviation,
                   (long)xUntilData.lTotalDriftUs);

            printf("[DATA]UNTIL,%lu,%lu,%ld,%ld,%lu\r\n",
                   (unsigned long)ulSample,
                   (unsigned long)ulLastPeriod,
                   (long)lDeviation,
                   (long)xUntilData.lTotalDriftUs,
                   (unsigned long)xTaskGetTickCount());
        }

        /**
         * vTaskDelayUntil() - Delay ABSOLUT
         * 
         * Parameter:
         *   1. &xLastWakeTime - Pointer ke variabel yang menyimpan
         *      tick count terakhir kali task bangun.
         *      Diupdate OTOMATIS oleh fungsi ini.
         *   2. xPeriod - Periode yang diinginkan dalam ticks
         * 
         * PENTING: xLastWakeTime HARUS diinisialisasi dengan 
         * xTaskGetTickCount() sebelum loop pertama!
         */
        vTaskDelayUntil(&xLastWakeTime, pdMS_TO_TICKS(TASK_UNTIL_PERIOD_MS));
    }
}

/**
 * Task Monitor: Cetak perbandingan statistik
 * 
 * Task ini mencetak perbandingan komprehensif antara:
 *   - vTaskDelay: periode, drift, jitter
 *   - vTaskDelayUntil: periode, drift, jitter
 * 
 * Memungkinkan analisis visual perbedaan kedua metode.
 */
static void vTaskMonitor(void *pvParameters) {
    (void)pvParameters;

    uint32_t ulCycle = 0;

    printf("[%s] Task monitor dimulai - Period %d ms\r\n\r\n",
           MONITOR_TASK_NAME, MONITOR_PERIOD_MS);

    /* Tunggu beberapa detik agar data terkumpul */
    vTaskDelay(pdMS_TO_TICKS(3000));

    for (;;) {
        ulCycle++;
        TickType_t xTick = xTaskGetTickCount();
        uint32_t ulUptime = xTick / configTICK_RATE_HZ;

        printf("\r\n");
        vPrintSeparator('=', 70);
        printf("  PERBANDINGAN vTaskDelay vs vTaskDelayUntil\r\n");
        printf("  Monitor Cycle: %lu | Uptime: %lu detik | Tick: %lu\r\n",
               (unsigned long)ulCycle, (unsigned long)ulUptime,
               (unsigned long)xTick);
        vPrintSeparator('=', 70);

        /* ---- Statistik vTaskDelay ---- */
        printf("\r\n  [1] vTaskDelay(%d ms) - Delay RELATIF\r\n", TASK_DELAY_PERIOD_MS);
        vPrintSeparator('-', 50);
        vPrintTimingStats(TASK_DELAY_NAME, &xDelayData);

        /* ---- Statistik vTaskDelayUntil ---- */
        printf("\r\n  [2] vTaskDelayUntil(%d ms) - Delay ABSOLUT\r\n", TASK_UNTIL_PERIOD_MS);
        vPrintSeparator('-', 50);
        vPrintTimingStats(TASK_UNTIL_NAME, &xUntilData);

        /* ---- Perbandingan ---- */
        printf("\r\n  === PERBANDINGAN LANGSUNG ===\r\n");
        vPrintSeparator('-', 50);

        if (xDelayData.ulSampleCount > 0 && xUntilData.ulSampleCount > 0) {
            uint32_t ulDelayMean = xDelayData.ulSumPeriodUs / xDelayData.ulSampleCount;
            uint32_t ulUntilMean = xUntilData.ulSumPeriodUs / xUntilData.ulSampleCount;

            printf("  %-20s | %-12s | %-12s\r\n", "Metrik", "vTaskDelay", "vDelayUntil");
            vPrintSeparator('-', 50);
            printf("  %-20s | %10lu us | %10lu us\r\n", "Rata-rata Periode",
                   (unsigned long)ulDelayMean, (unsigned long)ulUntilMean);
            printf("  %-20s | %10lu us | %10lu us\r\n", "Jitter",
                   (unsigned long)xDelayData.ulJitterUs,
                   (unsigned long)xUntilData.ulJitterUs);
            printf("  %-20s | %+10ld us | %+10ld us\r\n", "Drift Total",
                   (long)xDelayData.lTotalDriftUs,
                   (long)xUntilData.lTotalDriftUs);
            printf("  %-20s | %10lu    | %10lu\r\n", "Jumlah Sampel",
                   (unsigned long)xDelayData.ulSampleCount,
                   (unsigned long)xUntilData.ulSampleCount);

            /* Data perbandingan untuk Python parser */
            printf("[DATA]COMPARE,%lu,%lu,%lu,%lu,%ld,%ld\r\n",
                   (unsigned long)ulDelayMean,
                   (unsigned long)ulUntilMean,
                   (unsigned long)xDelayData.ulJitterUs,
                   (unsigned long)xUntilData.ulJitterUs,
                   (long)xDelayData.lTotalDriftUs,
                   (long)xUntilData.lTotalDriftUs);

            /* Kesimpulan otomatis */
            printf("\r\n  >>> KESIMPULAN <<<\r\n");
            
            int32_t lDelayDev = (int32_t)ulDelayMean - 
                                (int32_t)xDelayData.ulExpectedPeriodUs;
            int32_t lUntilDev = (int32_t)ulUntilMean - 
                                (int32_t)xUntilData.ulExpectedPeriodUs;

            printf("  vTaskDelay   : Deviasi rata-rata %+ld us dari target\r\n",
                   (long)lDelayDev);
            printf("  vDelayUntil  : Deviasi rata-rata %+ld us dari target\r\n",
                   (long)lUntilDev);
            
            if (xDelayData.ulJitterUs > xUntilData.ulJitterUs) {
                printf("  vTaskDelayUntil LEBIH STABIL (jitter %lu vs %lu us)\r\n",
                       (unsigned long)xUntilData.ulJitterUs,
                       (unsigned long)xDelayData.ulJitterUs);
            }

