rofiqcp/Praktikum-Sistem-Embedded/Modul-08-FreeRTOS-Task/praktikum/STM32/STM32_03_Task_Delay_Periodic/src/main.c
            uint32_t ulAbsDriftDelay = (xDelayData.lTotalDriftUs >= 0) ? 
                (uint32_t)xDelayData.lTotalDriftUs : (uint32_t)(-xDelayData.lTotalDriftUs);
            uint32_t ulAbsDriftUntil = (xUntilData.lTotalDriftUs >= 0) ?
                (uint32_t)xUntilData.lTotalDriftUs : (uint32_t)(-xUntilData.lTotalDriftUs);
            
            if (ulAbsDriftDelay > ulAbsDriftUntil) {
                printf("  vTaskDelay mengakumulasi drift %lu us lebih banyak!\r\n",
                       (unsigned long)(ulAbsDriftDelay - ulAbsDriftUntil));
            }
        }

        /* Stack usage info */
        printf("\r\n  --- Stack Usage ---\r\n");
        printf("  %s: %lu words free\r\n", TASK_DELAY_NAME,
               (unsigned long)uxTaskGetStackHighWaterMark(xTaskDelayHandle));
        printf("  %s: %lu words free\r\n", TASK_UNTIL_NAME,
               (unsigned long)uxTaskGetStackHighWaterMark(xTaskUntilHandle));
        printf("  %s: %lu words free\r\n", MONITOR_TASK_NAME,
               (unsigned long)uxTaskGetStackHighWaterMark(xMonitorHandle));
        printf("  Heap Free: %lu bytes\r\n",
               (unsigned long)xPortGetFreeHeapSize());

        printf("[DATA]HEAP,%lu,%lu\r\n",
               (unsigned long)xPortGetFreeHeapSize(),
               (unsigned long)xTick);

        /* Toggle LED status */
        LED_STATUS_TOGGLE();

        /* vTaskList setiap 5 cycle */
        if (ulCycle % 5 == 0) {
            printf("\r\n  === vTaskList ===\r\n");
            char pcBuf[512];
            vTaskList(pcBuf);
            printf("%s", pcBuf);
        }

        vPrintSeparator('=', 70);

        vTaskDelay(pdMS_TO_TICKS(MONITOR_PERIOD_MS));
    }
}

/* ============================ MAIN FUNCTION ============================== */

int main(void) {
    /* Inisialisasi hardware */
    HAL_Init();
    SystemClock_Config();
    GPIO_Init();
    UART1_Init();
    DWT_Init();

    /* Banner */
    printf("\r\n\r\n");
    vPrintSeparator('*', 70);
    printf("*   STM32F103 FreeRTOS - Program 03: Task Delay Periodic          *\r\n");
    printf("*   Perbandingan vTaskDelay() vs vTaskDelayUntil()                 *\r\n");
    vPrintSeparator('*', 70);
    printf("\r\n");

    printf("  [INFO] System Clock     : %lu MHz\r\n",
           (unsigned long)(HAL_RCC_GetSysClockFreq() / 1000000));
    printf("  [INFO] Target Period    : %d ms (%d us)\r\n",
           TASK_DELAY_PERIOD_MS, TASK_DELAY_PERIOD_MS * 1000);
    printf("  [INFO] Workload Iters   : %lu\r\n", (unsigned long)WORKLOAD_ITERATIONS);
    printf("  [INFO] Max Samples      : %d\r\n", MAX_SAMPLES);
    printf("  [INFO] DWT Counter      : Aktif (resolusi %.1f ns)\r\n",
           1000000000.0 / 72000000.0);
    printf("  [INFO] FreeRTOS Heap    : %u bytes\r\n",
           (unsigned int)configTOTAL_HEAP_SIZE);
    printf("\r\n");

    printf("  [HEAP] Sebelum task: %lu bytes free\r\n\r\n",
           (unsigned long)xPortGetFreeHeapSize());

    /* Buat task */
    BaseType_t xResult;

    xResult = xTaskCreate(vTaskDelayDemo, TASK_DELAY_NAME, TASK_DELAY_STACK,
                          NULL, TASK_DELAY_PRIORITY, &xTaskDelayHandle);
    printf("  [%s] Task '%s': %s\r\n",
           xResult == pdPASS ? "OK" : "GAGAL", TASK_DELAY_NAME,
           xResult == pdPASS ? "Berhasil" : "Gagal");

    xResult = xTaskCreate(vTaskDelayUntilDemo, TASK_UNTIL_NAME, TASK_UNTIL_STACK,
                          NULL, TASK_UNTIL_PRIORITY, &xTaskUntilHandle);
    printf("  [%s] Task '%s': %s\r\n",
           xResult == pdPASS ? "OK" : "GAGAL", TASK_UNTIL_NAME,
           xResult == pdPASS ? "Berhasil" : "Gagal");

    xResult = xTaskCreate(vTaskMonitor, MONITOR_TASK_NAME, MONITOR_STACK_SIZE,
                          NULL, MONITOR_PRIORITY, &xMonitorHandle);
    printf("  [%s] Task '%s': %s\r\n",
           xResult == pdPASS ? "OK" : "GAGAL", MONITOR_TASK_NAME,
           xResult == pdPASS ? "Berhasil" : "Gagal");

    printf("\r\n  [HEAP] Setelah task: %lu bytes free\r\n",
           (unsigned long)xPortGetFreeHeapSize());

    printf("\r\n  Memulai FreeRTOS Scheduler...\r\n");
    vPrintSeparator('=', 70);

    ucSchedulerStarted = 1;
    vTaskStartScheduler();

    printf("\r\n[FATAL] Scheduler gagal!\r\n");
    for (;;) {
        HAL_GPIO_TogglePin(LED_DELAY_PORT, LED_DELAY_PIN);
        HAL_Delay(50);
    }
}

/* ====================== HAL CALLBACK OVERRIDES =========================== */

void HAL_MspInit(void) {
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_AFIO_REMAP_SWJ_NOJTAG();
}
